In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.rand(4,2), index = [['a','a','b','b'], [1,2,1,2]], columns=['data1','data2'])
df

        data1     data2
a 1  0.222043  0.875891
  2  0.686373  0.663915
b 1  0.091035  0.778270
  2  0.085427  0.959690

In [4]:
index = [('California',2000),('California',2010),('New York',2000),('New York',2010),('Texas',2000),('Texas',2010)]
populations = [33871,37253,18976,19378,20851,25145]
pop = pd.Series(populations, index = index)
pop

(California, 2000)    33871
(California, 2010)    37253
(New York, 2000)      18976
(New York, 2010)      19378
(Texas, 2000)         20851
(Texas, 2010)         25145
dtype: int64

In [5]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [6]:
pop = pop.reindex(index)
pop

California  2000    33871
            2010    37253
New York    2000    18976
            2010    19378
Texas       2000    20851
            2010    25145
dtype: int64

In [7]:
pop[:, 2010]

California    37253
New York      19378
Texas         25145
dtype: int64

In [8]:
pop['Texas':]

Texas  2000    20851
       2010    25145
dtype: int64

In [9]:
pop_df = pop.unstack()
pop_df

             2000   2010
California  33871  37253
New York    18976  19378
Texas       20851  25145

In [10]:
pop_df = pd.DataFrame({'total':pop, 'under18': [9267,9284,4687,4318,5906,6879]})
pop_df

                 total  under18
California 2000  33871     9267
           2010  37253     9284
New York   2000  18976     4687
           2010  19378     4318
Texas      2000  20851     5906
           2010  25145     6879

In [12]:
# f_u18.unstack()

### Data combinations

In [13]:
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [14]:
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [15]:
ser1 = pd.Series(['A','B','C'], index=[1,2,3])
ser2 = pd.Series(['D','E','F'], index=[4,5,6])
print(ser1, ser2)
pd.concat([ser1, ser2])

1    A
2    B
3    C
dtype: object 4    D
5    E
6    F
dtype: object

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [18]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
print(df1,"\n\n",df2,"\n")
print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2

     A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [19]:
df3 = make_df('AB',[0,1])
df4 = make_df('CD',[0,1])
print(df3,"\n\n",df4,"\n")
print(pd.concat([df3,df4],axis=1))

    A   B
0  A0  B0
1  A1  B1

     C   D
0  C0  D0
1  C1  D1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [22]:
x = make_df('AB',[0,1])
y = make_df('AB',[2,3])
y.index = x.index
print(x,"\n\n",y,"\n\n",pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1

     A   B
0  A2  B2
1  A3  B3

     A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [26]:
# print(x,"\n\n",y,"\n\n",pd.concat([x,y],verify_integrity=True))

In [24]:
print(x,"\n\n",y,"\n\n",pd.concat([x,y],ignore_index=True))

    A   B
0  A0  B0
1  A1  B1

     A   B
0  A2  B2
1  A3  B3

     A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [25]:
print(x,"\n\n",y,"\n\n",pd.concat([x,y],keys=['x','y']))

    A   B
0  A0  B0
1  A1  B1

     A   B
0  A2  B2
1  A3  B3

       A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [27]:
df5 = make_df('ABC',[1,2])
df6 = make_df('BCD',[3,4])
print(df5,"\n\n", df6, "\n\n", pd.concat([df5,df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

     B   C   D
3  B3  C3  D3
4  B4  C4  D4

      A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [28]:
print(df5,"\n\n", df6, "\n\n", pd.concat([df5,df6], join='outer'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

     B   C   D
3  B3  C3  D3
4  B4  C4  D4

      A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [30]:
print(df1,"\n\n", df2, "\n\n", df1._append(df2))

    A   B
1  A1  B1
2  A2  B2

     A   B
3  A3  B3
4  A4  B4

     A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [32]:
# One-on-one
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 'group':['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 'hire_date':[2004,2008,2012,2020]})

print(df1,"\n\n",df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   employee  hire_date
0      Bob       2004
1     Jake       2008
2     Lisa       2012
3      Sue       2020

In [33]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2012
3      Sue           HR       2020

In [35]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'], 'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3,"\n\n", df4, "\n\n", pd.merge(df3,df4))

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2012
3      Sue           HR       2020

          group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

   employee        group  hire_date supervisor
0      Bob   Accounting       2004      Carly
1     Jake  Engineering       2008      Guido
2     Lisa  Engineering       2012      Guido
3      Sue           HR       2020      Steve

### Many-to-many joins

In [37]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
print(df1,'\n\n',df5,'\n\n',pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

          group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

   employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [39]:
print(df1,'\n\n',df2,'\n\n',pd.merge(df1, df2, on = 'employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   employee  hire_date
0      Bob       2004
1     Jake       2008
2     Lisa       2012
3      Sue       2020

   employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2012
3      Sue           HR       2020

In [40]:
df7 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1,'\n\n',df7,'\n\n',pd.merge(df1, df7, left_on = 'employee', right_on='name'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

    name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

   employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [41]:
print(df1,'\n\n',df7,'\n\n',pd.merge(df1, df7, left_on = 'employee', right_on='name').drop('name',axis=1))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

    name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

   employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

### GroupBy: Split, Apply, Combine

In [42]:
cer = pd.read_csv('cereal.csv')
cer

,name,mfr,type,calories,protein,fat,sodium,fiber,carbo,sugars,potass,vitamins,shelf,weight,cups,rating
0,100% Bran,N,C,70,4,1,130,10.0,5.0,6,280,25,3,1.0,0.33,68.402973
1,100% Natural Bran,Q,C,120,3,5,15,2.0,8.0,8,135,0,3,1.0,1.00,33.983679
2,All-Bran,K,C,70,4,1,260,9.0,7.0,5,320,25,3,1.0,0.33,59.425505
3,All-Bran with Extra Fiber,K,C,50,4,0,140,14.0,8.0,0,330,25,3,1.0,0.50,93.704912
4,Almond Delight,R,C,110,2,2,200,1.0,14.0,8,-1,25,3,1.0,0.75,34.384843
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72,Triples,G,C,110,2,1,250,0.0,21.0,3,60,25,3,1.0,0.75,39.106174
73,Trix,G,C,110,1,1,140,0.0,13.0,12,25,25,2,1.0,1.00,27.753301
74,Wheat Chex,R,C,100,3,1,230,3.0,17.0,3,115,25,1,1.0,0.67,49.787445
75,Wheaties,G,C,100,3,1,200,3.0,17.0,3,110,25,1,1.0,1.00,51.592193
76,Wheaties Honey Gold,G,C,110,2,1,200,1.0,16.0,8,60,25,1,1.0,0.75,36.187559

In [43]:
cer.groupby('mfr')['calories'].mean()

mfr
A    100.000000
G    111.363636
K    108.695652
N     86.666667
P    108.888889
Q     95.000000
R    115.000000
Name: calories, dtype: float64

In [45]:
cer.describe()

,calories,protein,fat,sodium,fiber,carbo,sugars,potass,vitamins,shelf,weight,cups,rating
count,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000
mean,106.883117,2.545455,1.012987,159.675325,2.151948,14.597403,6.922078,96.077922,28.246753,2.207792,1.029610,0.821039,42.665705
std,19.484119,1.094790,1.006473,83.832295,2.383364,4.278956,4.444885,71.286813,22.342523,0.832524,0.150477,0.232716,14.047289
min,50.000000,1.000000,0.000000,0.000000,0.000000,-1.000000,-1.000000,-1.000000,0.000000,1.000000,0.500000,0.250000,18.042851
25%,100.000000,2.000000,0.000000,130.000000,1.000000,12.000000,3.000000,40.000000,25.000000,1.000000,1.000000,0.670000,33.174094
50%,110.000000,3.000000,1.000000,180.000000,2.000000,14.000000,7.000000,90.000000,25.000000,2.000000,1.000000,0.750000,40.400208
75%,110.000000,3.000000,2.000000,210.000000,3.000000,17.000000,11.000000,120.000000,25.000000,3.000000,1.000000,1.000000,50.828392
max,160.000000,6.000000,5.000000,320.000000,14.000000,23.000000,15.000000,330.000000,100.000000,3.000000,1.500000,1.500000,93.704912

In [44]:
cer.groupby('mfr')['calories'].describe()

     count        mean        std    min    25%    50%    75%    max
mfr
A      1.0  100.000000        NaN  100.0  100.0  100.0  100.0  100.0
G     22.0  111.363636  10.371873  100.0  110.0  110.0  110.0  140.0
K     23.0  108.695652  22.218818   50.0  100.0  110.0  115.0  160.0
N      6.0   86.666667  10.327956   70.0   82.5   90.0   90.0  100.0
P      9.0  108.888889  10.540926   90.0  100.0  110.0  120.0  120.0
Q      8.0   95.000000  29.277002   50.0   87.5  100.0  120.0  120.0
R      8.0  115.000000  22.677868   90.0  100.0  110.0  120.0  150.0

In [47]:
cer.groupby('mfr')['rating'].describe()

,count,mean,std,min,25%,50%,75%,max
mfr,,,,,,,,
A,1.0,54.850917,NaN,54.850917,54.850917,54.850917,54.850917,54.850917
G,22.0,34.485852,8.946704,19.823573,27.963172,36.181877,39.587829,51.592193
K,23.0,44.038462,14.457434,29.924285,34.478442,40.560159,50.013484,93.704912
N,6.0,67.968567,5.509326,59.363993,65.459333,68.319429,71.702084,74.472949
P,9.0,41.705744,10.047647,28.025765,35.252444,40.917047,52.076897,53.371007
Q,8.0,42.915990,16.797673,18.042851,30.955582,47.419974,53.310322,63.005645
R,8.0,41.542997,6.080841,34.139765,36.448858,41.721976,45.528205,49.787445

In [48]:
cer.groupby('mfr')['rating'].describe().unstack()

       mfr
count  A       1.000000
       G      22.000000
       K      23.000000
       N       6.000000
       P       9.000000
       Q       8.000000
       R       8.000000
mean   A      54.850917
       G      34.485852
       K      44.038462
       N      67.968567
       P      41.705744
       Q      42.915990
       R      41.542997
std    A            NaN
       G       8.946704
       K      14.457434
       N       5.509326
       P      10.047647
       Q      16.797673
       R       6.080841
min    A      54.850917
       G      19.823573
       K      29.924285
       N      59.363993
       P      28.025765
       Q      18.042851
       R      34.139765
25%    A      54.850917
       G      27.963172
       K      34.478442
       N      65.459333
       P      35.252444
       Q      30.955582
       R      36.448858
50%    A      54.850917
       G      36.181877
       K      40.560159
       N      68.319429
       P      40.917047
       Q      47.419974
       R      41.721976
75%    A      54.850917
       G      39.587829
       K      50.013484
       N      71.702084
       P      52.076897
       Q      53.310322
       R      45.528205
max    A      54.850917
       G      51.592193
       K      93.704912
       N      74.472949
       P      53.371007
       Q      63.005645
       R      49.787445
dtype: float64

In [49]:
cer.groupby('mfr')['rating'].aggregate(['min', 'median', 'max'])

           min     median        max
mfr
A    54.850917  54.850917  54.850917
G    19.823573  36.181877  51.592193
K    29.924285  40.560159  93.704912
N    59.363993  68.319429  74.472949
P    28.025765  40.917047  53.371007
Q    18.042851  47.419974  63.005645
R    34.139765  41.721976  49.787445

In [50]:
res = cer.groupby('mfr').min()['rating']
res

mfr
A    54.850917
G    19.823573
K    29.924285
N    59.363993
P    28.025765
Q    18.042851
R    34.139765
Name: rating, dtype: float64

In [54]:
def filter_func(x):
    return x['rating'].min() < 50.0

cer.groupby('mfr').filter(filter_func)[['name', 'mfr', 'rating']]

                         name mfr     rating
1           100% Natural Bran   Q  33.983679
2                    All-Bran   K  59.425505
3   All-Bran with Extra Fiber   K  93.704912
4              Almond Delight   R  34.384843
5     Apple Cinnamon Cheerios   G  29.509541
..                        ...  ..        ...
72                    Triples   G  39.106174
73                       Trix   G  27.753301
74                 Wheat Chex   R  49.787445
75                   Wheaties   G  51.592193
76        Wheaties Honey Gold   G  36.187559

[70 rows x 3 columns]

In [53]:
cer.groupby('mfr').filter(filter_func)[['rating', 'name']]

       rating                       name
1   33.983679          100% Natural Bran
2   59.425505                   All-Bran
3   93.704912  All-Bran with Extra Fiber
4   34.384843             Almond Delight
5   29.509541    Apple Cinnamon Cheerios
..        ...                        ...
72  39.106174                    Triples
73  27.753301                       Trix
74  49.787445                 Wheat Chex
75  51.592193                   Wheaties
76  36.187559        Wheaties Honey Gold

[70 rows x 2 columns]